#pragma once

#define MOVEMENT_LIST_PATH	"data/movement/list.dat"
#define ENEMY_LIST_PATH		"data/enemy/list.dat"
#define STAGE_LIST_PATH		"data/stage/list.dat"

//-------------------------------------------------------------------
/// @brief 파일로 저장된 Movement들의 정보를 메모리에 불러온다.
//-------------------------------------------------------------------
void LoadMovementData();

//-------------------------------------------------------------------
/// @brief 파일로 저장된 Enemy들의 정보를 메모리에 불러온다.
//-------------------------------------------------------------------
void LoadEnemyData();

//-------------------------------------------------------------------
/// @brief 스테이지의 정보가 담긴 파일들의 이름을 메모리에 불러온다.
//-------------------------------------------------------------------
void LoadStageList();

//-------------------------------------------------------------------
/// @brief 스테이지의 정보를 메모리에 불러온다.
//-------------------------------------------------------------------
void LoadStageData();