#include "stdafx.h"

#include "Console.h"
#include "Player.h"
#include "Bullet.h"
#include "Render.h"


char szScreenBuffer[dfSCREEN_HEIGHT][dfSCREEN_WIDTH];







//--------------------------------------------------------------------
// 게임 시작시 전체 데이터 초기화용.
//--------------------------------------------------------------------
void Initial(void);








//--------------------------------------------------------------------
// 게임 시작시 전체 데이터 초기화용.
//--------------------------------------------------------------------
void Initial(void)
{
	InitBulletArray();
	//-------------------------------------------------------------------
	// 플레이어 최초 데이터 초기화.
	// HP : 3 
	// 39,19 위치에서 시작 함.
	//-------------------------------------------------------------------
	gPlayer.hp = 3;
	gPlayer.iVisible = true;

	gPlayer.x = 39;
	gPlayer.y = 19;
}









void main(void)
{
	cs_Initial();

	Initial();

	//--------------------------------------------------------------------
	// 게임의 메인 루프
	// 이 루프가  1번 돌면 1프레임 이다.
	//--------------------------------------------------------------------
	while (1)
	{

		KeyProcess();


		UpdateBullet();

		Buffer_Clear();
		Draw_Player();
		DrawBullet();
		Buffer_Flip();


		Sleep(200);
	}

}